cs306/week01/mathematical-induction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-05-03 Thu 15:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mathematical Induction</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Rick Neff" />
</head>
<body>
<div id="content">
<h1 class="title">Mathematical Induction</h1>

<div id="outline-container-org9d304a4" class="outline-2">
<h2 id="org9d304a4">Empirical versus Mathematical Induction</h2>
<div class="outline-text-2" id="text-org9d304a4">
<blockquote>
<p>
Will the sun rise on January 1 next year? There is no way to be absolutely sure.
It is always possible that the world will end before then by divine decree or by
some natural calamity. &#x2026; The most we can say is that it is an excellent bet
that on the next New Year's day, the sun will rise as usual. Our jump from a
finite set of past sunrises to an infinite future set, or at least to a future
set with a large number of elements, is an empirical induction.
</p>

<p>
Mathematicians have an analogous technique known as mathematical induction or
complete induction that also supports a jump from a finite set of cases to a
larger or an infinite number of cases. Unlike empirical induction, the
mathematical technique is entirely deductive. A "jump proof", as it is sometimes
called, is as certain as any proof can be in mathematics.
</p>

<p>
To prove something by mathematical induction we must first have a series of
statements (usually an infinite series but not necessarily so) that can be put
into a one-to-one correspondence with the positive integers. Second, we must
establish that the statements are related to one another by &#x2026; the "hereditary
property". If any statement is true, its successor &#x2014; the "next" statement &#x2014;
is true. Third, we must show that the first statement is true. It then follows
with iron certainty that all the statements are true.
</p>

<p>
Jump proofs have been likened to a row of bricks or dominoes that are standing
on end and all topple over when you unbalance the first one. [It's like] a pile
of envelopes, each containing a note that says: "Open the next envelope, read
the order and carry it out." If you are committed to obeying the order in the
first envelope, you must open all the envelopes and obey all the orders.
</p>

<p>
&#x2014; Martin Gardner
</p>
</blockquote>
</div>
</div>

<div id="outline-container-org036e561" class="outline-2">
<h2 id="org036e561">The Principle of Mathematical Induction</h2>
<div class="outline-text-2" id="text-org036e561">
<p>
Verbose version:
</p>

<p class="verse">
IF a proposition involving the positive integer N<br />
&#xa0;&#xa0;&#xa0;can be proven to have the two properties:<br />
<br />
&#xa0;&#xa0;&#xa0;1) The proposition is true for N = 1, and<br />
<br />
&#xa0;&#xa0;&#xa0;2) IF K is any value of N<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;for which the proposition is true<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;THEN the proposition is also true<br />
&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;&#xa0;for the next value N = K + 1;<br />
THEN the proposition is true<br />
&#xa0;&#xa0;for all positive integral values of N.<br />
</p>

<p>
Succinct version: \(P(1) \land \forall k(P(k) \rightarrow P(k + 1))] \rightarrow \forall nP(n)\)
</p>
</div>
</div>

<div id="outline-container-org8e3eea9" class="outline-2">
<h2 id="org8e3eea9">Classic Example</h2>
<div class="outline-text-2" id="text-org8e3eea9">
<p>
Use mathematical induction to prove that the sum
of the first <i>n</i> odd positive integers is <i>n<sup>2</sup></i>.
</p>

<p>
Let <i>P(n)</i> be the proposition \(\sum_{j=1}^n (2j - 1) = n^2\)
</p>

<p>
<b>Basis Step:</b> <i>P(1)</i> is true since \(2 \cdot 1 - 1 = 1 = 1^2\)
</p>

<p>
<b>Inductive Step:</b> Assume <i>P(k)</i> is true, that is
</p>

<p>
\(\sum_{j=1}^k (2j - 1) = k^2,\) so then \(\sum_{j=1}^{k}(2j - 1) =
2 \cdot 1 - 1 + 2 \cdot 2 - 1 + \ldots + 2 \cdot k - 1\)
</p>

<p>
and to show <i>P(k)</i> &rarr; <i>P(k + 1)</i> (which completes the proof):
\[
\begin{array}{lll}
\sum_{j=1}^{k + 1}(2j - 1)&=&\sum_{j=1}^k(2j - 1) + 2(k + 1) - 1\\
&=& k^2 + 2(k + 1) - 1\\
&=& k^2 + 2k + 2 - 1\\
&=& k^2 + 2k + 1 = (k + 1)^2\\
\end{array}\]
QED
</p>
</div>
</div>

<div id="outline-container-org0e89e5b" class="outline-2">
<h2 id="org0e89e5b">Another Induction Proof (with a "non-one" basis step)</h2>
<div class="outline-text-2" id="text-org0e89e5b">
<p>
Let <i>P(n)</i> be <i>2<sup>n</sup> &gt; n<sup>2</sup></i>. Prove <i>&forall; n&gt;4 P(n).</i>
</p>

<p>
<b>Basis Step:</b> <i>P(5)</i> is true since <i>2<sup>5</sup> = 32 &gt; 25 = 5<sup>2</sup></i>
</p>

<p>
<b>Inductive Step:</b> Assume <i>P(k)</i> is true, that is <i>2<sup>k</sup> &gt; k<sup>2</sup></i>.
Then,
\[\begin{array}{rll}
 2^{k+1} &=& 2 \cdot 2^k\\
& & \\
         &>& k^2 + k^2\\
& & \\
         &>& k^2 + 4k\ \mbox{(since /k > 4/)}\\
& & \\
         &>& k^2 + 2k + 1\\
& & \\
         &=& (k + 1)^2.\\
 \end{array}
\]
QED
</p>

<p>
Question: Which step above used <i>2<sup>k</sup> &gt; k<sup>2</sup></i> (the inductive hypothesis)?
</p>
</div>
</div>

<div id="outline-container-orgcd14300" class="outline-2">
<h2 id="orgcd14300">You Try It</h2>
<div class="outline-text-2" id="text-orgcd14300">
<p>
Let <i>P(n)</i> be the statement that <i>n! &lt; n<sup>n</sup></i>, where \(n \in \mathbf Z^{+}, n > 1\).
</p>

<p>
What is the statement <i>P(2)</i>?
</p>

<p>
Just plug in <i>n = 2</i>: <i>P(2)</i> is the statement <i>2! &lt; 2<sup>2</sup></i>.
</p>

<p>
Show that <i>P(2)</i> is true, completing the basis step of the proof.
</p>

<p>
Since <i>2! = 2</i> and <i>2<sup>2</sup> = 4</i>, this is the true statement <i>2 &lt; 4</i>.
</p>

<p>
What is the inductive hypothesis? It is the statement <i>k! &lt; k<sup>k</sup></i>.
</p>

<p>
What do you need to prove in the inductive step?
</p>

<p>
You need to prove that for each <i>k &ge; 2</i> that <i>P(k)</i> implies
<i>P(k + 1)</i>.  In other words, show that assuming the inductive
hypothesis (<i>k! &lt; k<sup>k</sup></i>) you can prove that <i>(k + 1)! &lt; (k + 1)<sup>k + 1</sup></i>.
</p>

<p>
Complete the inductive step.
</p>

<p>
\((k + 1)! = (k + 1)k! < (k + 1)k^k < (k + 1)(k + 1)^k = (k + 1)^{k + 1}\)
</p>

<p>
Having completed both the basis step and the inductive step, by the
PMI, the statement is true for every \(n \in \mathbf Z^{+}, n > 1\).
</p>

<p>
QED
</p>
</div>
</div>

<div id="outline-container-org4770384" class="outline-2">
<h2 id="org4770384">Try Another One</h2>
<div class="outline-text-2" id="text-org4770384">
<p>
Find a formula for \(\frac{1}{1 \cdot 2} + \frac{1}{2 \cdot 3} +
\cdots + \frac{1}{n(n + 1)}\) by examining the values of this
expression for small values of <i>n</i>.
</p>

<p>
By computing the first few sums and getting the answers 1/2, 2/3,
and 3/4, it's easy to guess that the sum is \(n/(n + 1)\).
</p>

<p>
Prove this formula works for all \(n \in \mathbf Z^{+}\) using the PMI.
</p>

<p>
<b>BASE:</b> It is true for <i>n = 1</i>, since there is just one term, 1/2.
</p>

<p>
<b>IHOP:</b> Suppose that \(\frac{1}{1 \cdot 2} + \frac{1}{2 \cdot 3} + \cdots +
\frac{1}{k(k + 1)} = \frac{k}{k + 1}\)
</p>

<p>
<b>GOAL:</b> You must now show that \[\left[
  \frac{1}{1 \cdot 2} + \frac{1}{2 \cdot 3} + \cdots + \frac{1}{k(k +
    1)}\right] + \frac{1}{(k + 1)(k + 2)} = \frac{k + 1}{k + 2}\]
</p>

<p>
Use the IHOP and do the algebra, reaching the desired expression:
</p>

<p>
\(\frac{k}{k + 1} + \frac{1}{(k + 1)(k + 2)} = \frac{k^2 + 2k + 1}{(k + 1)(k + 2)} = \frac{k + 1}{k + 2}\)
</p>

<p>
QED
</p>
</div>
</div>

<div id="outline-container-org4a82e1c" class="outline-2">
<h2 id="org4a82e1c">Another Example</h2>
<div class="outline-text-2" id="text-org4a82e1c">
<p>
Let <i>P(n)</i> be <i>2<sup>n</sup> &gt; n<sup>4</sup></i>. (Or, <i>n<sup>4</sup> &lt; 2<sup>n</sup></i>.)
</p>

<p>
Prove <i>&forall; n&gt;16 P(n)</i>.
</p>

<p>
<b>Basis step:</b> <i>P(17)</i> is true since <i>2<sup>17</sup> = 131072 &gt; 83521 = 17<sup>4</sup>.</i>
</p>

<p>
<b>Inductive step:</b>
</p>

<p>
Assume <i>P(j)</i> is true.
</p>

<p>
(Note the switch to using <i>j</i> rather than <i>k</i> &#x2014; the point being that it
doesn't matter what variable name you use.)
</p>

<p>
Then it follows that \[\begin{array}{rll}(j + 1)^4 &=& j^4 + 4j^3 + 6j^2 + 4j + 1\\
                                    &<& j^4 + 4j^3 + 6j^3 + 4j^3 + 2j^3\\
                                    &=& j^4 + 16j^3\\
		  		    &<& j^4 + j^4\ (\mbox{since}\ 16 < j)\\
				    &=& 2j^4\\
				    &<& 2 \cdot 2^j\ \mbox{(by the inductive hypothesis)}\\
				    &=& 2^{j+1},\ \mbox{as desired}.\end{array}\]
</p>

<p>
QED
</p>

<p>
You should be able to generalize this to prove that \(\exists k\ \forall p\
\forall n>k\ (2^n > n^p).\)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Rick Neff</p>
<p class="date">Created: 2018-05-03 Thu 15:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
